<script lang="ts" setup>
import PageDescription from './components/page-description/PageDescription.vue'
</script>

<template>
  <main>
    <PageDescription
      class="main-top"
      :header="'Возврат'"
      :backgroundImagePath="'/images/backgroundBrands.png'"
      :pathEnd="'Возврат'"
      :description="'Ошиблись при выборе товара? Передумали? Ничего страшного! СтройкаСтор в течение 7 дней готова принять обратно или обменять Ваш товар'"
    />
    <div class="d-flex">
      <h2 class="flex-1">Возврат товара ненадлежащего качества</h2>
      <div class="flex-2">
        <p>В случае, если вы обнаружили недостаток у товара, сообщите об этом менеджеру магазина, в котором вы оформляли заказ в срок до 20 дней после дня получения заказа.</p>

<p>Если вы обнаружили, что с товаром что-то не так:</p>

<p>Если вы решили отказаться от товара при его получении, сообщите водителю о том, что вы обнаружили проблему у товара. Вам будет предложено заполнить необходимые документы (в т.ч. акт возврата), после чего товар будет возвращен в магазин.</p>
<p>Пожалуйста, имейте в виду, что при возврате товаров магазину может потребоваться проведение экспертизы.</p>
      </div>
    </div>
    <div class="d-flex">
      <h2 class="flex-1">Возврат денежных средств</h2>
      <div class="flex-2">
        После возврата товара в магазин СтройкаСтор и, при необходимости, проведения экспертизы, вам будут возвращены денежные средства в размере стоимости приобретенного товара. В случае возврата оплаты за товар надлежащего качества cтоимость оплаченной доставки или оказанных дополнительных услуг не возвращается. Если проведение экспертизы возвращаемого товара не требуется, операция по возврату денежных средств будет произведена в течение следующего рабочего дня по графику работы магазина. Пожалуйста, имейте ввиду, что поступление возвращенных средств на вашу карту зависит от сроков возврата, установленных банком вашей пластиковой карты.
      </div>
    </div>
    <div class="d-flex">
      <h2 class="flex-1">Обмен</h2>
      <div class="flex-2">
        <p>
        Вы можете обменять товар из своего заказа на другой, более подходящий для вас, как в процессе обработки вашего заказа, так и после получения вами вашего заказа, за исключением товаров, которые не подлежат возврату и обмену по законодательству РФ.
</p>
<p>До сборки (и отправки в службу доставки) вашего заказа обмен товаров возможен путем корректировки заказа менеджером магазина по согласованию с вами.
После получения своего заказа вы также можете произвести обмен приобретенного вами товара, за исключением товаров, которые не подлежат возврату и обмену по законодательству РФ.
В случае обмена товара надлежащего качества стоимость оплаченной доставки или оказанных дополнительных услуг не возвращается.</p>

<p>
Возврат товара для его обмена производится согласно правилам возврата товара надлежащего или ненадлежащего качества, описанных выше.</p>

<p>Пожалуйста, имейте ввиду, что при обмене/возврате товаров магазину может потребоваться проведение экспертизы.</p>
      </div>
    </div>
  </main>
</template>

<style scoped>
p:nth-child(1n+2) {
    margin-top: 20px;
}
.m-t-32 {
    margin-top: 32px;
}
.step-container {
    max-width: 278px;
    font-weight: 500;
}
</style>