<script lang="ts" setup>
import DropdownLite from "../../ui-kit/dropdown/DropdownLite.vue";
</script>

<template>
    <div class="faq-container">
        <h2>Часто задаваемые вопросы</h2>
        <div class="faq-content">
            <DropdownLite :buttonText="'Водитель уведомит меня о начале доставки доставки?'">
                Есть товары, которые можно купить сразу на сервисе, и товары, для покупки которых нужно перейти на сайт магазина. Условия их получения отличаются.
                В этом разделе описаны условия для товаров, которые можно купить. Также некоторые товары, которые продаются на Маркете, доставляются непосредственно продавцами и имеют пометку об этом. Для таких товаров могут быть доступны не все возможности, описанные ниже.
            </DropdownLite>
            <DropdownLite :buttonText="'Водитель уведомит меня о начале доставки доставки?'">Есть товары, которые можно купить сразу на сервисе, и товары, для покупки которых нужно перейти на сайт магазина. Условия их получения отличаются.
                В этом разделе описаны условия для товаров, которые можно купить. Также некоторые товары, которые продаются на Маркете, доставляются непосредственно продавцами и имеют пометку об этом. Для таких товаров могут быть доступны не все возможности, описанные ниже.</DropdownLite>
            <DropdownLite :buttonText="'Водитель уведомит меня о начале доставки доставки?'">Есть товары, которые можно купить сразу на сервисе, и товары, для покупки которых нужно перейти на сайт магазина. Условия их получения отличаются.
                В этом разделе описаны условия для товаров, которые можно купить. Также некоторые товары, которые продаются на Маркете, доставляются непосредственно продавцами и имеют пометку об этом. Для таких товаров могут быть доступны не все возможности, описанные ниже.</DropdownLite>
            <DropdownLite :buttonText="'Водитель уведомит меня о начале доставки доставки?'">Есть товары, которые можно купить сразу на сервисе, и товары, для покупки которых нужно перейти на сайт магазина. Условия их получения отличаются.
                В этом разделе описаны условия для товаров, которые можно купить. Также некоторые товары, которые продаются на Маркете, доставляются непосредственно продавцами и имеют пометку об этом. Для таких товаров могут быть доступны не все возможности, описанные ниже.</DropdownLite>
            <DropdownLite :buttonText="'Водитель уведомит меня о начале доставки доставки?'">Есть товары, которые можно купить сразу на сервисе, и товары, для покупки которых нужно перейти на сайт магазина. Условия их получения отличаются.
                В этом разделе описаны условия для товаров, которые можно купить. Также некоторые товары, которые продаются на Маркете, доставляются непосредственно продавцами и имеют пометку об этом. Для таких товаров могут быть доступны не все возможности, описанные ниже.</DropdownLite>
            <DropdownLite :buttonText="'Водитель уведомит меня о начале доставки доставки?'">Есть товары, которые можно купить сразу на сервисе, и товары, для покупки которых нужно перейти на сайт магазина. Условия их получения отличаются.
                В этом разделе описаны условия для товаров, которые можно купить. Также некоторые товары, которые продаются на Маркете, доставляются непосредственно продавцами и имеют пометку об этом. Для таких товаров могут быть доступны не все возможности, описанные ниже.</DropdownLite>
            <DropdownLite :buttonText="'Водитель уведомит меня о начале доставки доставки?'">Есть товары, которые можно купить сразу на сервисе, и товары, для покупки которых нужно перейти на сайт магазина. Условия их получения отличаются.
                В этом разделе описаны условия для товаров, которые можно купить. Также некоторые товары, которые продаются на Маркете, доставляются непосредственно продавцами и имеют пометку об этом. Для таких товаров могут быть доступны не все возможности, описанные ниже.</DropdownLite>
        </div>
    </div>
</template>

<style scoped>
.faq-container {
    margin: 0 140px 80px 140px;
    padding: 80px 196px;
    border: 1px solid #D1D1D3;
}
.faq-content {
    margin-top: 16px;
}
.faq-content .dropdown:nth-child(1n+2) {
    margin-top: 12px;
}
</style>